# Basic setup
brew "git"
cask "google-drive"
cask "macpass"
cask "bettertouchtool"

# Development setup
tap "homebrew/cask-fonts"
cask "font-hack"
cask "font-monocraft"
cask "font-open-sans"
cask "font-overpass"
cask "font-redhat"
cask "font-source-code-pro"

cask "iterm2"
brew "gnupg"
brew "pinentry-mac"
#cask "sublime-text"
cask "visual-studio-code"
brew "postgresql@13", restart_service: true, link: true
brew "memcached", restart_service: true
brew "redis", restart_service: true
brew "kafka"
brew "chruby"
brew "ruby-install"
brew "cmake"
brew "pkg-config"
brew "nvm"
brew "yarn"
brew "jq"
brew "watch"
brew "wget"
brew "yamllint"

# Other development tools
brew "act"
brew "bat"
brew "crystal"
brew "diff-so-fancy"
brew "dive"
brew "dos2unix"
brew "duti"
brew "ffmpeg"
brew "gh"
brew "git-filter-repo"
brew "gnu-sed"
brew "go"
brew "graphviz"
brew "hub"
brew "nmap"
brew "pass"
brew "the_silver_searcher"
brew "tree"

cask "docker"
brew "openshift-cli"
brew "operator-sdk"
brew "skopeo"

cask "pgadmin4"
cask "virtualbox"

tap "beeftornado/rmtree"
brew "beeftornado/rmtree/brew-rmtree"

# Other apps
cask "day-o"
cask "remarkable"
cask "skitch"
cask "slack"
cask "spotify"
cask "zoom"
